{
  "title": { "en": "Projects", "es": "Proyectos" },
  "tagline": {
    "en": "In addition to my professional work, I have also worked on a number of personal projects, both on my own and collaboratively",
    "es": "Junto con mis trabajos profesionales, también construyo proyectos personales. Aqui hay una selección de ellos"
  },
  "projects": [
    {
      "id": 1,
      "name": "Madrid Reds",
      "description": {
        "en": "An app that tracks the progress of a football team and players over the course of a season. Users can view results and an array of stats related to the team's progress. Players can set their own targets at the beginning of the season and check how they compare after each game played",
        "es": "Una app que sigue el progreso de los jugadores y el equipo durante la temporada. Usuarios pueden ver resultados y un montón de estadísticas relacionadas con el progreso del equipo. Los jugadores pueden definir sus objetivos como cuantos goles van a marcar etc y ver cómo evolucionan tras cada partido"
      },
      "link": "https://madrid-reds-6z4rr5ysna-pd.a.run.app/",
      "github": "https://github.com/jwellwood/m-reds"
    },
    {
      "id": 2,
      "name": {
        "en": "Plant Based Ponch",
        "es": "Plant Based Ponch"
      },
      "description": {
        "en": "A collection of reviews of restaurants visited and recipes created. Admins can add, edit and delete items, and each form is broken up into manageable chunks such as gallery, ratings and descriptions",
        "es": "Una colección de recetas veganas y críticas de restaurantes veganos. Creado por un blogger de Instagram que queria un sitio externo donde guardar y mostrar sus sitios visitados, y sus recetas creadas. Los usuarios admin pueden añadir, modificar y eliminar elementos, y cada formulario está separado en partes pequeños como galería, valoraciones y descripciones"
      },
      "link": "https://pbponch.firebaseapp.com/",
      "github": "https://github.com/jwellwood/recipes-and-reviews"
    },
    {
      "id": 3,
      "name": {
        "en": "Run Records",
        "es": "Run Records"
      },
      "description": {
        "en": "An app that allows users to track their running progress",
        "es": "Los usuarios pueden visualizar los datos de sus recorridos o carreras"
      },
      "link": "https://run-records.firebaseapp.com/",
      "github": "https://github.com/jwellwood/activity-tracker"
    },
    {
      "id": 4,
      "name": {
        "en": "Report Writer",
        "es": "Report Writer"
      },
      "description": {
        "en": "A tool that makes writing termly reports for teachers much easier. A lot of report writing is repetitive, and this app allows users to simply add a students name to automatically generate a report. This can be done through selecting various parts of a report such as intros, positives etc, or can simply be fully generated at the click of a button. Admins can add new comments to keep the writing style fresh and limit the possibility of repeat reports for different students",
        "es": "Una herramienta que hace mucho más fácil escribir informes de fin del trimestre para profesores. Mucho de escribir informes es repetitivo, y esta app hace que con tan poco como añadir el nombre del alumno, se genera automáticamente el informe. Esto se puede hacer a traves de elegir entre partes de un informe (como intros, comentarios positivos etc.) o igual generar el informe completo. Los usuarios admin pueden añadir o modificar los comentarios para mantener un estilo de escritura distinta, y evitar la posibilidad de repetir informes para distintos alumnos"
      },
      "link": "https://teacher-toolkit.firebaseapp.com/",
      "github": "https://github.com/njwdev/report-writer"
    },
    {
      "id": 5,
      "name": {
        "en": "Lockdown Poker",
        "es": "Lockdown Poker"
      },
      "description": {
        "en": "An app made for a poker club to keep track of the games played, money owed etc.",
        "es": "Una app para un club de poker para mantener un record de los juegos jugados y el dinero debido etc."
      },
      "link": "https://lockdown-poker.firebaseapp.com/",
      "github": "https://github.com/jwellwood/lockdown-poker"
    },
    {
      "id": 6,
      "name": {
        "en": "Shared Shopping",
        "es": "Shared Shopping"
      },
      "description": {
        "en": "An app that allows users to create and share their shopping lists with friends, family, flatmates etc. Items can be marked as bought or not, meaning everyone on the list knows what is needed",
        "es": "Una app que permite que los usuarios pueden crear y compartir sus listas de compra con amigos, familiares, o compañeros de piso"
      },
      "link": "https://sharedshoppinglists.herokuapp.com",
      "github": "https://github.com/njwdev/sharedshoppinglists"
    }
  ]
}
